import {useMemo} from "react";

import {List} from "07-shared/ui/List/List.jsx";

import s from './MainPage.module.scss';

export const MainPage = () => {
    const lists = useMemo( () =>[
        {
            "header": "Заголовок 1",
            "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
            "text": "какой-то текст 1 текст какой-то 1 какой-то"
        },
        {
            "header": "Заголовок 2",
            "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3", "элемент списка 1", "элемент списка 2", "элемент списка 3"],
            "text": "какой-то текст 1 текст какой-то 1 какой-то какой-то текст 1 текст какой-то 1 какой-то какой-то текст 1 текст какой-то 1 какой-то какой-то текст 1 текст какой-то 1 какой-то"
        },
        {
            "header": "Заголовок 3",
            "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3", "элемент списка 1", "элемент списка 2"],
            "text": "какой-то текст 1 текст какой-то 1 какой-то кт какой-то 1 какой-то какой-то текст 1 текст какой-то 1 какой-то"
        },
        {
            "header": "Заголовок 1",
            "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
            "text": "какой-то текст 1 текст какой-то 1 какой-то"
        }
    ],[])

    return <div className={s.wrapper}>
        {lists.map((list, index)=>{
            return <List key={index} info={list}/>
        })}
    </div>
}